ФормированиеТестовыхДанных/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ФормированиеТестовыхДанных/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ФормированиеТестовыхДанных/Catalogs/БанковскиеСчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ФормированиеТестовыхДанных_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПравоДоступаРедактированиеБанковскогоСчета = ПравоДоступа("Редактирование", Метаданные.Справочники.БанковскиеСчета);
	Элементы.ВалютаДенежныхСредствРасширение.Доступность = ПравоДоступаРедактированиеБанковскогоСчета;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	РедактироватьВалютуСчета = ЯвляетсяБанкомРФ;
	
	ЗаполнитьСлучайнымиРеквизитамиРасчетногоСчетаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеТестовыхДанных_ПриОткрытииПосле(Отказ)
	
	Элементы.ВалютаДенежныхСредствРасширение.Видимость = РедактироватьВалютуСчета;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФормированиеТестовыхДанных_БанкПриИзменении(Элемент)
	
	ЗаполнитьСлучайнымиРеквизитамиРасчетногоСчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеТестовыхДанных_БанкОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.Банк = Неопределено;
	Объект.НомерСчета = Неопределено;
	БИКБанка = "";
	
	БанковскиеСчетаФормыКлиент.УстановитьВалютуПодсказкуСчета(
		Объект, ЭтотОбъект, БИКБанка, ЦветВыделенияНекорректногоЗначение, ЯвляетсяБанкомРФ);
	
	ПодсказкаБанк = БанковскиеСчетаФормыКлиентСервер.ПодсказкаПоляБанка(ДеятельностьБанкаПрекращена);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеТестовыхДанных_ВалютаДенежныхСредствРасширениеПриИзменении(Элемент)
	
	ЗаполнитьСлучайнымиРеквизитамиРасчетногоСчета();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСлучайнымиРеквизитамиРасчетногоСчета()
	
	ЗаполнитьСлучайнымиРеквизитамиРасчетногоСчетаНаСервере();
	
	БанковскиеСчетаФормыКлиент.УстановитьВалютуПодсказкуСчета(
		Объект, ЭтотОбъект, БИКБанка, ЦветВыделенияНекорректногоЗначение, ЯвляетсяБанкомРФ);
	
	ПодсказкаБанк = БанковскиеСчетаФормыКлиентСервер.ПодсказкаПоляБанка(ДеятельностьБанкаПрекращена);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлучайнымиРеквизитамиРасчетногоСчетаНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРасчетногоСчета = ФормированиеТестовыхДанных.СлучайныеРеквизитыРасчетногоСчета(
		БИКБанка,
		Объект.ВалютаДенежныхСредств,
		ЮридическоеФизическоеЛицо(),
		ЭтоГосОрган());
		
	Если СтруктураРасчетногоСчета = Неопределено ИЛИ НЕ ЗначениеЗаполнено(СтруктураРасчетногоСчета.НомерСчета) Тогда
		РедактироватьВалютуСчета = Ложь;
		Возврат;
	КонецЕсли;
	
	РедактироватьВалютуСчета = СтруктураРасчетногоСчета.ЯвляетсяБанкомРФ;
	ЗаполнитьЗначенияСвойств(Объект, СтруктураРасчетногоСчета);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураРасчетногоСчета);
	
КонецПроцедуры

&НаСервере
Функция ЮридическоеФизическоеЛицо()
	
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Возврат Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ЮридическоеФизическоеЛицо");
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЭтоГосОрган()
	
	ЭтоГосОрган = Ложь;
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
		ЭтоГосОрган = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ГосударственныйОрган");
	КонецЕсли;
	
	Возврат ЭтоГосОрган;
	
КонецФункции

#КонецОбласти
